# Python + SQL

### Using SQL with pandas
---

## Introduction

Have you ever wanted to query a database within a Python program?  You can do that with the good old pandas library.

...and yes. There are *other* ways ;).

## Topics

* pandas and SQL
* why SQL in Python?
* the easiest way to SQL
* more robust SQL
* accessing SQL databases

## Imports

In [3]:
import pandas as pd
from pandasql import sqldf, load_births

## Dataset

In [4]:
births = load_births()

---

## The easiest way to use SQL - `sqldf`

* pandas SQL wrapper
* uses SQLite behind the scenes
* can treat pandas data frames as if they were tables
* good for small workloads
* SQL is somewhat limited (i.e. no right outer join)

In [5]:
print(sqldf('SELECT * FROM births WHERE births > 250000 limit 5;', locals()))

                         date  births
0  1975-01-01 00:00:00.000000  265775
1  1975-03-01 00:00:00.000000  268849
2  1975-05-01 00:00:00.000000  254545
3  1975-06-01 00:00:00.000000  254096
4  1975-07-01 00:00:00.000000  275163

### Come.. Let us try a query that spans multiple lines

In [6]:
q = """
  SELECT
    date(date) as DOB,
    sum(births) as "Total Births"
  FROM
    births
  GROUP BY
    date
    limit 5;
"""

print(sqldf(q, locals()))

          DOB  Total Births
0  1975-01-01        265775
1  1975-02-01        241045
2  1975-03-01        268849
3  1975-04-01        247455
4  1975-05-01        254545

In [22]:
print(pysqldf("""
  SELECT FirstName, LastName, EnglishOccupation as "Job Title"
  FROM df_customer
  ORDER BY LastName, FirstName limit 3
"""))

  FirstName LastName       Job Title
0     Aaron    Adams  Skilled Manual
1      Adam    Adams      Management
2      Alex    Adams  Skilled Manual

### Variable scope switcher function

In [8]:
# use this fn to change locals to globals in one place if you need to
def pysqldf(q):
    return sqldf(q, globals()) # (q, locals())

### How to load your own data (csv) with pandas

In [15]:
df_customer = pd.read_csv('./data/DimCustomer.csv')
df_customer.head(3)

   CustomerKey  GeographyKey  ... DateFirstPurchase CommuteDistance
0        11000            26  ...        2011-01-19       1-2 Miles
1        11001            37  ...        2011-01-15       0-1 Miles
2        11002            31  ...        2011-01-07       2-5 Miles

[3 rows x 29 columns]

### Set your own index

In [16]:
df_customer.set_index('CustomerKey', inplace=True)
df_customer.head(3)

             GeographyKey  ... CommuteDistance
CustomerKey                ...
11000                  26  ...       1-2 Miles
11001                  37  ...       0-1 Miles
11002                  31  ...       2-5 Miles

[3 rows x 28 columns]

### Examine the datatypes in your dataframe

In [ ]:
df_internet_sales = pd.read_csv('./data/FactInternetSales.csv')
df_internet_sales.dtypes # returns a Series with the data type of each column

### Join example

In [23]:
q = """
  SELECT *
  FROM df_customer
  left outer join df_internet_sales
    on (df_customer.CustomerKey = df_internet_sales.CustomerKey) limit 3
"""
pysqldf(q)

   CustomerKey  GeographyKey  ...                  DueDate                 ShipDate
0        11000            26  ...  2013-05-15 00:00:00.000  2013-05-10 00:00:00.000
1        11000            26  ...  2011-01-31 00:00:00.000  2011-01-26 00:00:00.000
2        11000            26  ...  2013-01-30 00:00:00.000  2013-01-25 00:00:00.000

[3 rows x 55 columns]